    /*

    Дана скобочная последовательность: [((())()(())]]
- Можно ли считать эту последовательность правильной?
- Если ответ на предыдущий вопрос “нет” - то что необходимо в ней изменить, чтоб она стала правильной?

Данная последовательность не может являться правильной так, как на каждую открывающую скобку, должна быть и
закрывающая. Сответственно, необходимо:
1. Добавить раскрывающую квадратную и закрывающую круглую скобку.
Например: [[((())()(()))]]

или

2. Удалить открывающую круглую и закрывающую квадратную скобку.
Например: [(())()(())]

     */

